# Используем официальный образ Python как базовый образ
FROM python:3.9

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файл зависимостей в рабочую директорию
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем исходный код приложения в контейнер
COPY . .

# Открываем порт, на котором будет запущено Django приложение
EXPOSE 8000

# Запускаем Django сервер разработки
CMD ["python", "manage.py", "runserver", "127.0.0.1:8000"]